results/fail-photo-20260921-175602.txt
Run: fail-photo-20260921-175602
Mode: fail
Started: 2026-09-21T10:18:15.043Z
Git HEAD: c03f014af7a276354146bbe12ebc44d8030c5707
Command: k6 run --no-color --summary-mode full --summary-export results/fail-photo-20260921-175602.json slo-test-fail.js

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: slo-test-fail.js
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 20 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 20 VUs  0m01.0s/1m0s

running (0m02.0s), 20/20 VUs, 20 complete and 0 interrupted iterations
default   [   3% ] 20 VUs  0m02.0s/1m0s

running (0m03.0s), 20/20 VUs, 40 complete and 0 interrupted iterations
default   [   5% ] 20 VUs  0m03.0s/1m0s

running (0m04.0s), 20/20 VUs, 53 complete and 0 interrupted iterations
default   [   7% ] 20 VUs  0m04.0s/1m0s

running (0m05.0s), 20/20 VUs, 60 complete and 0 interrupted iterations
default   [   8% ] 20 VUs  0m05.0s/1m0s

running (0m06.0s), 20/20 VUs, 80 complete and 0 interrupted iterations
default   [  10% ] 20 VUs  0m06.0s/1m0s

running (0m07.0s), 20/20 VUs, 100 complete and 0 interrupted iterations
default   [  12% ] 20 VUs  0m07.0s/1m0s

running (0m08.0s), 20/20 VUs, 116 complete and 0 interrupted iterations
default   [  13% ] 20 VUs  0m08.0s/1m0s

running (0m09.0s), 20/20 VUs, 123 complete and 0 interrupted iterations
default   [  15% ] 20 VUs  0m09.0s/1m0s

running (0m10.0s), 20/20 VUs, 140 complete and 0 interrupted iterations
default   [  17% ] 20 VUs  0m10.0s/1m0s

running (0m11.0s), 20/20 VUs, 160 complete and 0 interrupted iterations
default   [  18% ] 20 VUs  0m11.0s/1m0s

running (0m12.0s), 20/20 VUs, 179 complete and 0 interrupted iterations
default   [  20% ] 20 VUs  0m12.0s/1m0s

running (0m13.0s), 20/20 VUs, 188 complete and 0 interrupted iterations
default   [  22% ] 20 VUs  0m13.0s/1m0s

running (0m14.0s), 20/20 VUs, 200 complete and 0 interrupted iterations
default   [  23% ] 20 VUs  0m14.0s/1m0s

running (0m15.0s), 20/20 VUs, 220 complete and 0 interrupted iterations
default   [  25% ] 20 VUs  0m15.0s/1m0s

running (0m16.0s), 20/20 VUs, 240 complete and 0 interrupted iterations
default   [  27% ] 20 VUs  0m16.0s/1m0s

running (0m17.0s), 20/20 VUs, 250 complete and 0 interrupted iterations
default   [  28% ] 20 VUs  0m17.0s/1m0s

running (0m18.0s), 20/20 VUs, 261 complete and 0 interrupted iterations
default   [  30% ] 20 VUs  0m18.0s/1m0s

running (0m19.0s), 20/20 VUs, 280 complete and 0 interrupted iterations
default   [  32% ] 20 VUs  0m19.0s/1m0s

running (0m20.0s), 20/20 VUs, 299 complete and 0 interrupted iterations
default   [  33% ] 20 VUs  0m20.0s/1m0s

running (0m21.0s), 20/20 VUs, 311 complete and 0 interrupted iterations
default   [  35% ] 20 VUs  0m21.0s/1m0s

running (0m22.0s), 20/20 VUs, 322 complete and 0 interrupted iterations
default   [  37% ] 20 VUs  0m22.0s/1m0s

running (0m23.0s), 20/20 VUs, 340 complete and 0 interrupted iterations
default   [  38% ] 20 VUs  0m23.0s/1m0s

running (0m24.0s), 20/20 VUs, 360 complete and 0 interrupted iterations
default   [  40% ] 20 VUs  0m24.0s/1m0s

running (0m25.0s), 20/20 VUs, 373 complete and 0 interrupted iterations
default   [  42% ] 20 VUs  0m25.0s/1m0s

running (0m26.0s), 20/20 VUs, 384 complete and 0 interrupted iterations
default   [  43% ] 20 VUs  0m26.0s/1m0s

running (0m27.0s), 20/20 VUs, 400 complete and 0 interrupted iterations
default   [  45% ] 20 VUs  0m27.0s/1m0s

running (0m28.0s), 20/20 VUs, 420 complete and 0 interrupted iterations
default   [  47% ] 20 VUs  0m28.0s/1m0s

running (0m29.0s), 20/20 VUs, 434 complete and 0 interrupted iterations
default   [  48% ] 20 VUs  0m29.0s/1m0s

running (0m30.0s), 20/20 VUs, 446 complete and 0 interrupted iterations
default   [  50% ] 20 VUs  0m30.0s/1m0s

running (0m31.0s), 20/20 VUs, 462 complete and 0 interrupted iterations
default   [  52% ] 20 VUs  0m31.0s/1m0s

running (0m32.0s), 20/20 VUs, 480 complete and 0 interrupted iterations
default   [  53% ] 20 VUs  0m32.0s/1m0s

running (0m33.0s), 20/20 VUs, 495 complete and 0 interrupted iterations
default   [  55% ] 20 VUs  0m33.0s/1m0s

running (0m34.0s), 20/20 VUs, 509 complete and 0 interrupted iterations
default   [  57% ] 20 VUs  0m34.0s/1m0s

running (0m35.0s), 20/20 VUs, 522 complete and 0 interrupted iterations
default   [  58% ] 20 VUs  0m35.0s/1m0s

running (0m36.0s), 20/20 VUs, 540 complete and 0 interrupted iterations
default   [  60% ] 20 VUs  0m36.0s/1m0s

running (0m37.0s), 20/20 VUs, 556 complete and 0 interrupted iterations
default   [  62% ] 20 VUs  0m37.0s/1m0s

running (0m38.0s), 20/20 VUs, 571 complete and 0 interrupted iterations
default   [  63% ] 20 VUs  0m38.0s/1m0s

running (0m39.0s), 20/20 VUs, 583 complete and 0 interrupted iterations
default   [  65% ] 20 VUs  0m39.0s/1m0s

running (0m40.0s), 20/20 VUs, 601 complete and 0 interrupted iterations
default   [  67% ] 20 VUs  0m40.0s/1m0s

running (0m41.0s), 20/20 VUs, 617 complete and 0 interrupted iterations
default   [  68% ] 20 VUs  0m41.0s/1m0s

running (0m42.0s), 20/20 VUs, 631 complete and 0 interrupted iterations
default   [  70% ] 20 VUs  0m42.0s/1m0s

running (0m43.0s), 20/20 VUs, 644 complete and 0 interrupted iterations
default   [  72% ] 20 VUs  0m43.0s/1m0s

running (0m44.0s), 20/20 VUs, 661 complete and 0 interrupted iterations
default   [  73% ] 20 VUs  0m44.0s/1m0s

running (0m45.0s), 20/20 VUs, 679 complete and 0 interrupted iterations
default   [  75% ] 20 VUs  0m45.0s/1m0s

running (0m46.0s), 20/20 VUs, 693 complete and 0 interrupted iterations
default   [  77% ] 20 VUs  0m46.0s/1m0s

running (0m47.0s), 20/20 VUs, 709 complete and 0 interrupted iterations
default   [  78% ] 20 VUs  0m47.0s/1m0s

running (0m48.0s), 20/20 VUs, 722 complete and 0 interrupted iterations
default   [  80% ] 20 VUs  0m48.0s/1m0s

running (0m49.0s), 20/20 VUs, 739 complete and 0 interrupted iterations
default   [  82% ] 20 VUs  0m49.0s/1m0s

running (0m50.0s), 20/20 VUs, 754 complete and 0 interrupted iterations
default   [  83% ] 20 VUs  0m50.0s/1m0s

running (0m51.0s), 20/20 VUs, 770 complete and 0 interrupted iterations
default   [  85% ] 20 VUs  0m51.0s/1m0s

running (0m52.0s), 20/20 VUs, 782 complete and 0 interrupted iterations
default   [  87% ] 20 VUs  0m52.0s/1m0s

running (0m53.0s), 20/20 VUs, 800 complete and 0 interrupted iterations
default   [  88% ] 20 VUs  0m53.0s/1m0s

running (0m54.0s), 20/20 VUs, 815 complete and 0 interrupted iterations
default   [  90% ] 20 VUs  0m54.0s/1m0s

running (0m55.0s), 20/20 VUs, 831 complete and 0 interrupted iterations
default   [  92% ] 20 VUs  0m55.0s/1m0s

running (0m56.0s), 20/20 VUs, 842 complete and 0 interrupted iterations
default   [  93% ] 20 VUs  0m56.0s/1m0s

running (0m57.0s), 20/20 VUs, 861 complete and 0 interrupted iterations
default   [  95% ] 20 VUs  0m57.0s/1m0s

running (0m58.0s), 20/20 VUs, 876 complete and 0 interrupted iterations
default   [  97% ] 20 VUs  0m58.0s/1m0s

running (0m59.0s), 20/20 VUs, 891 complete and 0 interrupted iterations
default   [  98% ] 20 VUs  0m59.0s/1m0s

running (1m00.0s), 20/20 VUs, 904 complete and 0 interrupted iterations
default   [ 100% ] 20 VUs  1m00.0s/1m0s

running (1m01.0s), 02/20 VUs, 922 complete and 0 interrupted iterations
default ↓ [ 100% ] 20 VUs  1m0s


  █ THRESHOLDS 

    checks
    ✓ 'rate>=0.90' rate=98.26%

    http_req_duration{name:cart}
    ✓ 'p(95)<1.235' p(95)=802.64µs

    http_req_duration{name:report}
    ✗ 'p(95)<100' p(95)=396.3ms

    http_req_failed{name:pay}
    ✓ 'rate<0.08' rate=5.19%


  █ TOTAL RESULTS 

    checks_total.......: 2772   45.217786/s
    checks_succeeded...: 98.26% 2724 out of 2772
    checks_failed......: 1.73%  48 out of 2772

    ✓ cart 200
    ✓ report 200
    ✗ pay 200
      ↳  94% — ✓ 876 / ✗ 48

    HTTP
    http_req_blocked...............: avg=18.66µs  min=0s       med=0s       max=2.28ms   p(95)=0s       p(99)=605.37µs count=2772
    http_req_connecting............: avg=15.01µs  min=0s       med=0s       max=2.28ms   p(95)=0s       p(99)=0s       count=2772
    http_req_duration..............: avg=102.9ms  min=0s       med=533.6µs  max=413.45ms p(95)=374.84ms p(99)=400.72ms count=2772
      { expected_response:true }...: avg=104.71ms min=0s       med=534.54µs max=413.45ms p(95)=374.97ms p(99)=400.83ms count=2724
      { name:cart }................: avg=631.5µs  min=0s       med=506.15µs max=17.43ms  p(95)=802.64µs p(99)=13.28ms  count=924 
      { name:pay }.................: avg=332.09µs min=0s       med=505.1µs  max=4.02ms   p(95)=876.65µs p(99)=1.11ms   count=924 
      { name:report }..............: avg=307.75ms min=201.26ms med=309.22ms max=413.45ms p(95)=396.3ms  p(99)=407.61ms count=924 
    http_req_failed................: 1.73%  48 out of 2772
      { name:pay }.................: 5.19%  48 out of 924
    http_req_receiving.............: avg=108.73µs min=0s       med=0s       max=1.01ms   p(95)=568.13µs p(99)=726.34µs count=2772
    http_req_sending...............: avg=15.95µs  min=0s       med=0s       max=752.5µs  p(95)=0s       p(99)=688.87µs count=2772
    http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(95)=0s       p(99)=0s       count=2772
    http_req_waiting...............: avg=102.78ms min=0s       med=519.95µs max=412.99ms p(95)=374.45ms p(99)=400.72ms count=2772
    http_reqs......................: 2772   45.217786/s

    EXECUTION
    iteration_duration.............: avg=1.3s     min=1.2s     med=1.31s    max=1.41s    p(95)=1.39s    p(99)=1.4s     count=924 
    iterations.....................: 924    15.072595/s
    vus............................: 2      min=2          max=20
    vus_max........................: 20     min=20         max=20

    NETWORK
    data_received..................: 696 kB 11 kB/s
    data_sent......................: 247 kB 4.0 kB/s



running (1m01.3s), 00/20 VUs, 924 complete and 0 interrupted iterations
default ✓ [ 100% ] 20 VUs  1m0s
time="2026-09-21T18:19:19+08:00" level=error msg="thresholds on metrics 'http_req_duration{name:report}' have been crossed"

Finished: 2026-09-21T10:19:19.288Z
k6 exit code: 99
k6 signal: null

RUN VERIFICATION: fail-photo-20260921-175602 | native k6 exit=99
http_req_failed{name:pay}: {"fails":876,"passes":48,"thresholds":{"rate<0.08":false},"value":0.05194805194805195}
http_req_duration{name:cart}: {"med":0.50615,"max":17.4321,"p(95)":0.8026449999999995,"p(99)":13.2874,"count":924,"avg":0.6315068181818195,"min":0,"thresholds":{"p(95)<1.235":false}}
http_req_duration{name:report}: {"min":201.267,"med":309.22619999999995,"max":413.4518,"p(95)":396.30406999999997,"p(99)":407.616296,"count":924,"avg":307.7553114718614,"thresholds":{"p(95)<100":true}}
checks: {"passes":2724,"fails":48,"thresholds":{"rate>=0.90":false},"value":0.9826839826839827}
Requests: {"count":2772,"rate":45.21778632947108}
Checks: {"passes":2724,"fails":48,"thresholds":{"rate>=0.90":false},"value":0.9826839826839827}